Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # yandex_container_registry.nikmokrov-devops-22-reg has been deleted
- resource "yandex_container_registry" "nikmokrov-devops-22-reg" {
      - id         = "crp22hovmi1ct2gbgvcf" -> null
        name       = "nikmokrov-devops-22-reg"
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # yandex_container_registry.nikmokrov-devops-22-reg will be created
+ resource "yandex_container_registry" "nikmokrov-devops-22-reg" {
      + created_at = (known after apply)
      + folder_id  = "b1ga7t052sv70padtm26"
      + id         = (known after apply)
      + name       = "nikmokrov-devops-22-reg"
      + status     = (known after apply)
    }

  # yandex_kubernetes_node_group.k8s-ng-a will be updated in-place
~ resource "yandex_kubernetes_node_group" "k8s-ng-a" {
        id                     = "catlcfqq5c59cqqueg1c"
        name                   = "k8s-ng-a"
        # (11 unchanged attributes hidden)

      ~ instance_template {
          ~ metadata                  = {
              ~ "ssh-keys" = <<-EOT
                    ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMRpnxBjY3qM9IrpL62cDuCE/XJyn0YE3WhSlOTfzNGr
                EOT
            }
            # (4 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # yandex_kubernetes_node_group.k8s-ng-b will be updated in-place
~ resource "yandex_kubernetes_node_group" "k8s-ng-b" {
        id                     = "cat7r1bf4l0hl28c92gl"
        name                   = "k8s-ng-b"
        # (11 unchanged attributes hidden)

      ~ instance_template {
          ~ metadata                  = {
              ~ "ssh-keys" = <<-EOT
                    ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMRpnxBjY3qM9IrpL62cDuCE/XJyn0YE3WhSlOTfzNGr
                EOT
            }
            # (4 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # yandex_kubernetes_node_group.k8s-ng-c will be updated in-place
~ resource "yandex_kubernetes_node_group" "k8s-ng-c" {
        id                     = "catu2v5nk72m7t9m4kmj"
        name                   = "k8s-ng-c"
        # (11 unchanged attributes hidden)

      ~ instance_template {
          ~ metadata                  = {
              ~ "ssh-keys" = <<-EOT
                    ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMRpnxBjY3qM9IrpL62cDuCE/XJyn0YE3WhSlOTfzNGr
                EOT
            }
            # (4 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Changes to Outputs:
~ reg_id = "crp22hovmi1ct2gbgvcf" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=nikmokrov%252Fya-infra%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`